const config = {
  title: '警示',
  children: {
    4: { // ADAS功能
      function: 4,
      title: '主动安全报警',
      routerName: 'FunctionStandard',
      info: {
        goal: '终端可与驾驶员不安全驾驶行为监测系统、右转盲区监测系统通信。',
        device: '导航卫星信号模拟器',
        criterion: '不安全驾驶行为有：吸烟、打电话、分神、打瞌睡等。当车辆右转弯时，右转盲区内有行人、非机动车或其他机动车时，终端接收并上传盲区异常提醒信息。'
      },
      flows: [{
          describe: '准备（终端上线，终端接入ADAS摄像头）'
        },
        {
          describe: '操作人员触发并上传“危险驾驶行为报警”至平台。'
        },
        {
          describe: '当车辆右转时，右转忙去内有行人、非机动车或其他机动车时，终端接收并上传“右转盲区异常报警“'
        }, {
          describe: '检测人员根据触发准确性给予结果判定。'
        }
      ]
    },
    5: { // 行驶状态报警
      function: 5,
      title: '行驶状态报警',
      routerName: 'FunctionStandard',
      info: {
        goal: '终端可根据预设的速度阈值或通过接收监控中心下发的信息触发报警。车辆或者驾驶员连续驾驶时间超过疲劳驾驶时间阈值时触发报警。停车时间超过系统预设时间时触发报警。',
        device: '任意波形发生器',
        criterion: '根据监控中心要求的速度变化，正确触发并上报报警信息。'
      },
      flows: [{
          describe: '准备（终端上线，模拟车速信号设备）'
        },
        {
          describe: ['检测人员手动清除设备的累积驾驶时间，设备单次连续驾驶时间、单日累积驾驶时间超过疲劳驾驶时间阈值时，应上报“疲劳驾驶报警”，平台下发', {
            type: 'button',
            title: '疲劳驾驶参数设置指令',
            params: {
              type: '5-2-1'
            }
          }]
        },
        {
          describe: '设备运行3分钟左右后休息（速度为0）1分钟左右（不能超过2分钟），然后继续运行，总时间达到5分钟时，上报“疲劳驾驶报警”报警时长为2分钟，休息2分钟以上，继续运行此时不再上报疲劳驾驶，当累积行驶时间达到6分钟时，上报“当天累计驾驶超时报警”。'
        },
        {
          describe: ['检测人员通过操作模拟车速信号设备，下发', {
            type: 'button',
            title: '超速报警参数设置指令',
            params: {
              type: '5-4-1'
            }
          }]
        }, {
          describe: '平台将以首条超速的位置信息时间为起始点计时，10秒后终端应上报带有“超速报警”标志的位置信息。'
        }, {
          describe: ['当停车时间超过系统预设时间时，终端应上报“超时停车报警”，下发', {
              type: 'button',
              title: '超时停车参数设置指令',
              params: {
                type: '5-6-1'
              }
            },
            ',通过模拟车速信号设备，将终端速度降为0公里/小时。'
          ]
        },
        {
          describe: '7.设备出于停车状态（速度为0），1分钟后上报“超时停车报警”。'
        },
        {
          describe: ['请检测人员根据准则判断是否通过。平台下发', {
            type: 'button',
            title: '清除行驶状态参数设置指令',
            params: {
              type: '5-8-1'
            }
          }]
        }
      ]
    },
    6: { // 进出区域
      function: 6,
      title: '进出区域',
      routerName: 'FunctionStandard',
      info: {
        goal: '终端中应存储有不少于24个多边形或圆形区域，当车辆驶入禁入区域或驶出禁出区域时触发，监控区域可由监控中心远程设置。',
        device: '导航卫星信号模拟器',
        criterion: '终端根据检测中心模拟的场景，在规定的时间上传进出区域报警，再根据场景上传符合数量的0900数据。'
      },
      flows: [{
          describe: '准备（终端上线，导航卫星信号模拟器使用xxx场景）'
        },
        {
          describe: ['终端上线定位后，平台下发', {
            type: 'button',
            title: '终端参数设置指令',
            params: {
              type: '6-2-1'
            }
          }, '下发', {
            type: 'button',
            title: '矩形区域设置指令',
            params: {
              type: '6-2-2'
            }
          }]
        },
        {
          describe: '导航卫星信号模拟器发送相应的经纬度信号，使终端进入指定区域'
        }, {
          describe: '导航卫星信号模拟器发送相应的经纬度信号，使终端离开指定的区域'
        }, {
          describe: '在检测平台上观察终端上报的数据帧，查看终端是否上报（出）区域报警'
        }, {
          describe: ['导航卫星信号模拟器轨迹场景播放完毕，请点击', {
            componentName: 'doLookLogBtn',
            type: '6-6-1'
          }, '，显示判定结果后，请下发', {
            type: 'button',
            title: '删除区域指令',
            params: {
              type: '6-6-1'
            }
          }]
        }
      ]
    },
    7: { // 偏移路线
      function: 7,
      title: '路线偏离报警',
      routerName: 'FunctionStandard',
      info: {
        goal: '终端中应存储有不少于24条路线，每条路线应是16个或以上点构成的折线。当车辆驶离设定的路线时触发，监控路线可由监控中心远程设置。',
        device: '导航卫星信号模拟器',
        criterion: '车辆驶离设定的路线时，上报对应报警的位置信息。'
      },
      flows: [{
          describe: '准备（终端上线，导航卫星信号模拟器使用xxx场景）'
        },
        {
          describe: ['终端上线定位后，平台下发', {
            type: 'button',
            title: '终端参数设置指令',
            params: {
              type: '7-2-1'
            }
          }, '下发', {
            type: 'button',
            title: '设置路线指令',
            params: {
              type: '7-2-2'
            }
          }]
        },
        {
          describe: '导航卫星信号模拟器发送相应的经纬度信号，使终端偏离指定的路线，在平台上观察终端上报的数据帧，查看终端是否上报偏移路线报警。'
        }, {
          describe: ['导航卫星信号模拟器轨迹场景轨迹播放完毕，请点击', {
            componentName: 'doLookLogBtn',
            type: '7-4-1'
          }, '，显示判定结果后，请下发', {
            type: 'button',
            title: '删除路线指令',
            params: {
              type: '7-4-1'
            }
          }]
        }
      ]
    },
    8: { // 人工报警确认
      function: 8,
      title: '人工报警确认',
      routerName: 'FunctionStandard',
      info: {
        goal: '终端报警处理中，对终端上报的报警，监控人员进行判断后可对报警进行人工确认，之后解除报警。',
        device: '无',
        criterion: '终端触发紧急报警后，终端应向平台突报包含报警信息的位置信息，同时终端关闭语音报读功模块，且立即启动摄像头完成拍照并上传平台，平台确认报警后解除报警。'
      },
      flows: [{
          describe: '准备（终端上线）'
        },
        {
          describe: [
            '平台下发',
            {
              type: 'button',
              title: '终端参数设置',
              params: {
                type: '8-2-1'
              }
            }, '以“紧急报警”为报警拍摄存储标志。'
          ]
        },
        {
          describe: '检测人员人工触发紧急报警，向平台上传报警信息（包含车辆报警信息、位置信息、图像信息）'
        }, {
          describe: '触发紧急报警后，终端应向平台突报包含报警信息的位置信息，同时终端关闭语音报读功模块，且立即启动摄像头完成拍照并上传平台。'
        },
        {
          describe: [
            '平台收到报警图片，平台点击',
            {

              title: '查看多媒体文件',
              componentName: 'lookPhoto'
            }, '确认图片信息后通过。'
          ]
        },
        {
          describe: [
            '平台下发',
            {
              type: 'button',
              title: '人工报警确认指令',
              params: {
                type: '8-6-1'
              }
            }, '0x8203，终端按照指令确认报警后，即可通过。'
          ]
        }
      ]
    },
    9: { // 自动提醒
      function: 9,
      title: '自动提醒',
      routerName: 'FunctionStandard',
      info: {
        goal: '终端检测车辆电瓶欠压提醒、断电提醒、轮胎压力异常提醒、侧翻提醒、碰撞提醒、终端故障提醒等报警项。',
        device: '导航卫星信号模拟器',
        criterion: '胎压预警阈值为5Bar，终端应通过操作主机、电源及外设上报检测用例中对应的报警位。'
      },
      flows: [{
          describe: '准备（终端上线）'
        },
        {
          // title: '轮胎压力异常：控制胎压监测模块输出信号，当低于阈值5 Bar时，上报“胎压预警”。',
          describe: [
            ['轮胎压力异常：控制胎压监测模块输出信号，当低于阈值5 Bar时，上报“胎压预警”。']
          ]
        },
        {
          // title: '电瓶欠压：检测人员操作电源处于欠压状态，终端上报“终端主电源欠压报警”。平台收到报警后即可通过。',
          describe: [
            ['电瓶欠压：检测人员操作电源处于欠压状态，终端上报“终端主电源欠压报警”。平台收到报警后即可通过。']
          ]
        },
        {
          // title: '断电提醒：检测人员操作电源处于欠压状态，终端上报“终端主电源掉电报警”。平台收到报警后即可通过。',
          describe: [
            ['断电提醒：检测人员操作电源处于欠压状态，终端上报“终端主电源掉电报警”。平台收到报警后即可通过。']
          ]
        },
        {
          // title: '终端故障：检测人员操作断开与终端连接外接设备，使终端上报“终端故障报警”。平台收到报警后即可通过。',
          describe: [
            ['终端故障：检测人员操作断开与终端连接外接设备，使终端上报“终端故障报警”。平台收到报警后即可通过。']
          ]
        },
        {
          title: '侧翻碰撞：',
          describe: [
            [
              'a)平台下发侧翻碰撞', {
                type: 'button',
                title: '终端参数设置',
                params: {
                  type: '9-6-1'
                }
              }
            ],
            [{
              type: 'txt'
            }, 'b)调节倾斜实验台角度至15度，通过检测平台查看是否收到终端上报的侧翻预警报警。'],
            [{
              type: 'txt'
            }, 'c)调节倾斜实验台角度至25度，通过检测平台查看是否收到终端上报的侧翻预警报警。'],
            [{
              type: 'txt'
            }, 'd)调节倾斜实验台角度至35度，通过检测平台查看是否收到终端上报的侧翻预警报警。'],
            [{
              type: 'txt'
            }, 'e)用外力碰撞终端 （碰撞时间>20 ms；碰撞加速度>1g）通过检测平台查看是否收到终端上报的碰撞预警报警。']
          ]
        },
      ]
    },
    10: { // 禁行时段报警  27
      function: 27,
      title: '禁行时段报警',
      routerName: 'FunctionStandard',
      info: {
        goal: '终端可根据预设的禁行时段或通过接受监控中心下发的信息触发，以提醒驾驶员当前处于禁行时段状态。',
        device: '导航卫星信号模拟器',
        criterion: '禁止时段默认以平台设置为准。'
      },
      flows: [{
          describe: '准备（终端上线，设备连接卫星导航模拟器）'
        },
        {
          describe: ['平台下发',
            {
              type: 'button',
              title: '禁行时段参数',
              params: {
                type: '27-2-1'
              }
            }
          ]
        }, {
          describe: '当终端行驶状态下进入禁行时段时，产生报警上传平台。'
        }, {
          describe: '当终端行驶状态下超出禁行驶段后，解除报警。'
        }, {
          describe: ['平台下发',
            {
              type: 'button',
              title: '清除禁行时段指令',
              params: {
                type: '27-5-1'
              }
            }
          ]
        }
      ]
    }
  }
}
config.childrenNum = Object.keys(config.children).length
export default config
